In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('./data.csv')

In [6]:
df

    name  age
0  Alice   25
1    Bob   30

In [8]:
df.loc[2,'name'] = "Charlie"
df.loc[2,'age'] =34

In [9]:
df.to_csv('./data.csv')

# Data exploration

In [10]:
df.head()

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  34.0

In [11]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [12]:
df.tail(2)

      name   age
1      Bob  30.0
2  Charlie  34.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes